src/Catalogs/VATCodes.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<Catalog>
		<Properties>
			<Name>VATCodes</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>VATDescription</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>SalesItems</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Name</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>InclRate</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ExclRate</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ReturnBox</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.VATReturnFormBoxes</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Agency</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Companies</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Account</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.ChartOfAccounts</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>PurchaseItems</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Name</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>InclRate</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ExclRate</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ReturnBox</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.VATReturnFormBoxes</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Agency</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Companies</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Account</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.ChartOfAccounts</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CommonModules/VAT_FL/Ext/Module.bsl
//////////////////////////////////////////////////////////////////////////////// 
// THIS MODULE CONTAINS FUNCTIONS AND PROCEDURES USED BY
// THE VAT LOCALIZATION FUNCTIONALITY
// 


// Returns a VAT amount for a document line.
//
// Parameters:
// Number.
// Catalog.VATCode.
// String - "Purchase" or "Sales".
//
// Returned value:
// Number.
//
Function VATLine(LineTotal, VATCode, Direction, PriceIncludesVAT) Export
	
	VATAmount = 0;
	
	Query = New Query("SELECT
	|	VATCodes." + Direction + "Items.(
	|		InclRate, ExclRate
	|	)
	|FROM
	|	Catalog.VATCodes AS VATCodes
	|WHERE
	|	VATCodes.Ref = &VATCode");
	
	Query.SetParameter("VATCode", VATCode);	
	QueryResult = Query.Execute();

	If QueryResult.IsEmpty() Then	
		Return 0;	
	Else
		Dataset = QueryResult.Unload();
		DataRow = Dataset[0]; 
		DataItem = DataRow[0];
		NoOfRows = DataItem.Count();
		For i = 0 To NoOfRows - 1 Do
			
			LineRate = 0;
			If PriceIncludesVAT Then
				LineRate = DataItem[i].InclRate;
			Else
				LineRate = DataItem[i].ExclRate;
			EndIf;
			
			VATAmount = VATAmount + LineTotal * LineRate / 100;		
		EndDo;
		Return VATAmount;
	EndIf;	
	
EndFunction


// needs to be updated!!! returns only one accounts - needs to return an array
Function VATAccount(VATCode, Direction) Export
	
	Query = New Query("SELECT
	|	VATCodes." + Direction + "Items.(
	|		Account
	|	)
	|FROM
	|	Catalog.VATCodes AS VATCodes
	|WHERE
	|	VATCodes.Ref = &VATCode");
	
	Query.SetParameter("VATCode", VATCode);	
	QueryResult = Query.Execute();

	Dataset = QueryResult.Unload();
	DataRow = Dataset[0]; 
	DataItem = DataRow[0];
	
	Return DataItem[0].Account;
	
EndFunction
